cosc583/proj7/writeup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-11-08 Sat 20:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Password Cracking</title>
<meta name="author" content="Jackson Mowry" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Password Cracking</h1>
<div id="outline-container-org5b1c961" class="outline-2">
<h2 id="org5b1c961">Cracking Details</h2>
<div class="outline-text-2" id="text-org5b1c961">
<ul class="org-ul">
<li>What tool did you select to use? Why?<br />
<ul class="org-ul">
<li>To crack all 16 passwords I ended up using a mix of both John the Ripper and Hashcat. I utilized both tools as this allowed to use both of their default rulesets to avoid having to write a ton of my own to cover all permutations of both. Additionally, I read online that Hashcat is often faster, which led me to use the tool. However, in the end I observed similar speeds using both tools.<br /></li>
</ul></li>
<li>What was your average rate for password checks a second (c/s in JTR)?<br />
<ul class="org-ul">
<li>On an NVIDIA 4060 I was able to achieve around 12 million checks per second in JTR. On the same 4060 I would get around 13 million checks per second in Hashcat.<br /></li>
</ul></li>
<li>What guessing strategies did you employ?<br />
<ul class="org-ul">
<li>My guessing strategies were copied straight from the project writeup, using each of the 4 given password composition rules to guide my choice in ruleset. These ruleset choices were combined with a large english word dictionary available through my operating system&rsquo;s package manager, and the default word lists provided with both tools.<br /></li>
</ul></li>
<li>List the passwords that you cracked. List the strategy used to crack each of these passwords.<br />
<ul class="org-ul">
<li>$1$ii13OK6b$j39q6K.6TKBzZzCGxqTH20:41t3rn4t3<br />
<ul class="org-ul">
<li>Cracking using hashcat, combination of the unix leetspeak ruleset and some custom changes to transform more letters<br /></li>
</ul></li>
<li>user2:7OgTHT::::::<br />
<ul class="org-ul">
<li>Cracked using JTR, Alnum rule set to lengths between 2-6<br /></li>
</ul></li>
<li>$1$ZScxtUI7$O38W8SgWrPsvLjl4UA4Og1:14b0r4t0ri35<br />
<ul class="org-ul">
<li>Cracking using hashcat, combination of the unix leetspeak ruleset and some custom changes to transform more letters<br /></li>
</ul></li>
<li>$1$f5Bw0IKt$2u7QmNwYzD7lqArefbYVb/:int3rn4ti0n411y<br />
<ul class="org-ul">
<li>Cracking using hashcat, combination of the unix leetspeak ruleset and some custom changes to transform more letters<br /></li>
</ul></li>
<li>user5:lkyru::::::<br />
<ul class="org-ul">
<li>Cracked using JTR, Alnum rule set to lengths between 2-6<br /></li>
</ul></li>
<li>user6:forwarding::::::<br />
<ul class="org-ul">
<li>Cracked using JTR, word list without modifications<br /></li>
</ul></li>
<li>user7:increased::::::<br />
<ul class="org-ul">
<li>Cracked using JTR, word list without modifications<br /></li>
</ul></li>
<li>user8:31iz4b3th::::::<br />
<ul class="org-ul">
<li>Cracked using JTR, custom leetspeak rules<br /></li>
</ul></li>
<li>user9:31w4::::::<br />
<ul class="org-ul">
<li>Cracked using JTR, Alnum rule set to lengths between 2-6<br /></li>
</ul></li>
<li>user10:SJ::::::<br />
<ul class="org-ul">
<li>Cracked using JTR, Alnum rule set to lengths between 2-6<br /></li>
</ul></li>
<li>user11:2c8zc::::::<br />
<ul class="org-ul">
<li>Cracked using JTR, Alnum rule set to lengths between 2-6<br /></li>
</ul></li>
<li>user12:uddg::::::<br />
<ul class="org-ul">
<li>Cracked using JTR, Alnum rule set to lengths between 2-6<br /></li>
</ul></li>
<li>user13:c0mp4ni35::::::<br />
<ul class="org-ul">
<li>Cracked using JTR, custom leetspeak rules<br /></li>
</ul></li>
<li>user14:longitude::::::<br />
<ul class="org-ul">
<li>Cracked using JTR, word list without modifications<br /></li>
</ul></li>
<li>user15:ta::::::<br />
<ul class="org-ul">
<li>Cracked using JTR, Lowercase only<br /></li>
</ul></li>
<li>user16:revolutionary::::::<br />
<ul class="org-ul">
<li>Cracked using JTR, word list without modifications<br /></li>
</ul></li>
<li>user17:lr4::::::<br />
<ul class="org-ul">
<li>Cracked using JTR, Alnum rule set to lengths between 2-6<br /></li>
</ul></li>
<li>user18:ugrknq::::::<br />
<ul class="org-ul">
<li>Cracked using JTR, Alnum rule set to lengths between 2-6<br /></li>
</ul></li>
<li>user19:cincinnati::::::<br />
<ul class="org-ul">
<li>Cracked using JTR, word list without modifications<br /></li>
</ul></li>
<li>user20:lsv::::::<br />
<ul class="org-ul">
<li>Cracked using JTR, Lowercase only<br /></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org1b787fb" class="outline-2">
<h2 id="org1b787fb">Followup Questions</h2>
<div class="outline-text-2" id="text-org1b787fb">
<ol class="org-ol">
<li>Assuming that you used your setup for this project alone, how long do you calculate that it would take to crack a 6-character alphanumeric password? Eight characters? Ten characters? Twelve characters? Give exact estimates for either the average time needed to crack a password of the given length and composition, or the max time needed. Show your work.<br />
<ul class="org-ul">
<li>I utilized 6 NVIDIA 4060 GPUs for this project, which meant an average of 12 million checks per second on a single GPU, or 72 million checks per second all together. Utilizing the <code>--node</code> flag in JTR to split work across machines it would take around 13 minutes <code>(62**6) / 72,000,000 / 60 sec per min</code> to enumerate all 6 character alphanumeric passwords. Eight would scale to 842 hours, 10 scales to 134918 days, 12 scales to 1420892 years. Same formula for all examples just raising 62 to the power of the length.<br /></li>
</ul></li>
<li>Recently, high-end GPUs have revolutionized password cracking. An RTX 3080 (a recent high-end GPU) is able to check 2.5 billion passwords a second using MD5 crypt. Using this guessing rate, estimate how long it would take to crack the passwords described in Question 1.<br />
<ul class="org-ul">
<li>6 = 0.27 minutes<br /></li>
<li>8 = 17.32 hours<br /></li>
<li>10 = 2775.46 days<br /></li>
<li>12 = 29229.78 years<br /></li>
</ul></li>
<li>Do you think that the password meter is a good indication of actual password security? From the results of your experiment, what is your recommendation for minimum password length? Be creative in your response. Imagine what hardware and resources a potential attacker might have, and briefly justify your assessment of the attacker&rsquo;s capabilities.<br />
<ul class="org-ul">
<li>The quickest way to increase the time taken to guess a password it to make sure that it is long, assuming a reasonable mix of characters. The 12 character password example from the previous question is a perfect example of this. However, if we take that same 12 character password and reduce it to only using lowercase ASCII letters the time taken to crack drops to a staggering 0.86 years. For this reason while we should encourage users to utilize long passwords, we should also encourage a healthy mix of characters. I believe that password strength bars are an antiquated technique built for an error where utilizing a password manager was so easy. With the ease-of-use of a modern password manager a user shouldn&rsquo;t even have to know a single character of their possibly 36-character long password. If a user is relying on the password bar as a gauge of security they will probably be led to a false conclusion that maximizing one single metric (such a length or character mix) will give a secure password, when in reality true randomness of significant length is the most secure method for creating a password. If we have to give one single number for minimum password length I would simply set it to just over a year of time spent cracking on the most modern gaming GPU with an entirely lowercase password. This is the worst case for password strength on the users end, and the &ldquo;best&rdquo; reasonable case for a solo hacker who can afford a modern high-end GPU. This value comes out to 13 characters.<br /></li>
</ul></li>
<li>Fedora 14 and other modern Linux distributions use SHA-512 (rather than MD5) for hashing passwords. Does the use of this hashing algorithm improve password security in some way? Why or why not?<br />
<ul class="org-ul">
<li>Yes, MD5 produces 128-bit digests, which have a vastly smaller space than the 512-bit hashes used in SHA-512. At a minimum this means that 4 times larger hashes have to be computed and checked. Additionally, MD5 has known vulnerabilities and has been cracked before. Lastly, SHA-512 offers much greater preimage attack resistance, making the feasibility of finding a collision much higher.<br /></li>
</ul></li>
<li>Does the use of a salt increase password security? Why or why not?<br />
<ul class="org-ul">
<li>Yes, but only slightly. If a user has access to rainbow tables for a particular hash function and that hash function is being used without a salt, then &ldquo;cracking&rdquo; the password is trivial. If instead a salt is being used then the hacker either has to have many different rainbow tables, or more likely they will just begin brute forcing passwords with some of the strategies used in this very project. At the end of the day a salt should always be used as it further complicates the cracking process.<br /></li>
</ul></li>
<li>Against any competent system, an online attack of this nature would not be possible due to network lag, timeouts, and throttling by the system administrator. Does this knowledge lessen the importance of offline password attack protection?<br />
<ul class="org-ul">
<li>If there is any level of competence in the team administrating the site there is no chance an attack like this would be possible. In my quest to complete this project I was able to check 72 million passwords a second, with the MTU of a tcp packet commonly being 1500 bytes, we&rsquo;d be generating 108GB/s of network requests in the best possible case assuming our entire request fits in a tcp packet. Not only are consumer internet speeds far below that, with the advent of global firewall services such as cloudflare your traffic would quickly be identified and blocked. However, with a distributed botnet, it may be possible to achieve similar speeds with thousands or potentially even more systems attacking simultenously.<br /></li>
<li>No, I think it only heightens the importance of offline password attack protection as it is a much more feasible attack route for potential hackers.<br /></li>
</ul></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Sat Nov  8 19:44:43 2025</p>
<p class="author">Author: Jackson Mowry</p>
<p class="date">Created: 2025-11-08 Sat 20:29</p>
</div>
</body>
</html>
